// Всі функції повинні бути описані стрілочним типом!!!!
// - створити функцію яка обчислює та повертає площу прямокутника висотою
// let sRectangle = (a,b)=>a*b;
// console.log(sRectangle(3, 4));
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію яка обчислює та повертає площу кола
// let sCircle = (r,p=3.14)=>p*Math.pow(r,2)
// console.log(sCircle(4))
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію яка обчислює та повертає площу циліндру
// let sCylinder = (r,h,p=3.14)=>2*p*r*(r+h)
// console.log(sCylinder(3,4))
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію яка приймає масив та виводить кожен його елемент
// let array1 = (arr)=>{
//     for (const arrElement of arr) {
//         console.log(arrElement)
//     }
// }
// array1([1,2,3,4,5])
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію яка  створює параграф з текстом. Текст задати через аргумент
// let pTxt = (text)=>{
//     document.write(`<p>${text}</p>`)
// }
// pTxt('hello')
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// let ulLi3=(text)=>{
//     document.write('<ul>')
//     for (let i = 0; i < 3; i++) {
//         document.write(`<li>${text}</li>`)
//     }
//     document.write('</ul>')
// }
// ulLi3('hello')
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// let ulLiArg = (text,size)=>{
//     document.write('<ul>')
//     for (let i = 0; i < size; i++) {
//         document.write(`<li>${text}</li>`)
//     }
//     document.write('</ul>')
// }
// ulLiArg('hello',5)
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
// let array2 = (arr)=>{
//     document.write('<ol>')
//     for (const arrElement of arr) {
//         document.write(`<li>${arrElement}</li>`)
//     }
//     document.write('</ol>')
// }
// array2([1,2,3,4,'acwqv','cwvebhwr',true,false])
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.
// let arrObj = (arr)=>{
//     for (const arrElement of arr) {
//         document.write(`<div>${arrElement.id} - ${arrElement.name} - ${arrElement.age}</div>`)
//     }
// }
// arrObj([
//     {id: 1,name:'Dima',age:26},
//     {id: 2,name:'Sergiy',age:26},
//     {id: 3,name:'Nazar',age:21}
// ])
//----------------------------------------------------------------------------------------------------------------------