// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б

// let square = function s (a,b) {
//     return a * b
// }
// console.log(square(3, 5))
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію яка обчислює та повертає площу кола з радіусом r

// let square1 = function (p,r){
//     return p*(Math.pow(r,2))
// }
// console.log(square1(3.14,5))
//----------------------------------------------------------------------------------------------------------------------

// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r
// let square2 = function (h,r){
//     return (2*3.14)*r*h;
// }
// console.log(square2(2,3))
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію яка приймає масив та виводить кожен його елемент

// function users(array){
//     for (const arrayElement of array) {
//         console.log(arrayElement)
//     }
// }
// users([1,2,3,4,5])
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію яка створює параграф з текстом. Текст задати через аргумент
// function creatTxt (txt){
//     document.write(`<p>${txt}</p>`)
// }
// creatTxt('kjhcbkwvkcwvwcv')
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// function creatUl(txt){
//     document.write(`<ul>`)
//     for (let i = 0; i < 3; i++) {
//         document.write(`<li>${txt}</li>`)
//     }
//     document.write(`</ul>`)
// }
// creatUl('j khvevjhwjew')
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// function creatUl2(size, txt){
//     document.write(`<ul>`)
//     for (let i = 0; i < size; i++) {
//         document.write(`<li>${txt}</li>`)
//     }
//     document.write(`</ul>`)
// }
// creatUl2(5,'hello')
//----------------------------------------------------------------------------------------------------------------------
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
// function array(arr){
//     document.write(`<ul>`)
//     for (const arrElement of arr) {
//         document.write(`<li>${arrElement}</li>`)
//     }
//     document.write(`</ul>`)
// }
// array([1,2,3,4,'jkhasc','kj hw',true])
//
// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.


// let users = [
//     {id:1, name: 'Oleg',age: 14},
//     {id:2, name: 'Ira', age: 27},
//     {id:3, name: 'Dima', age: 26}
// ]
//
// function showUsers(arr){
//     for (const user of arr) {
//         document.write(`<div>${user.id} - ${user.name} - ${user.age}</div>`)
//     }
// }
// showUsers(users)







